{
  "init":{
     "rake":false,
     "carpet":false,
     "white":false,
     "black":false,
     "rand":false
  },
  "pages":[
     {
        "number":"1",
        "text":"Ветер треплет ваши волосы, если они у вас есть. В противоположном случае он скользит по вашему бритому черепу. Вдалеке грохочет гроза, и она ближе с каждой минутой. Убежище…вам нужно убежище. С комфортом и защитой. Впереди какой-то двор, обнесенный голубым забором, увитым плющом. Вы проходите через ворота",
        "options":[
           {
              "text":"далее",
              "route":"2"
           }
        ]
     },
     {
        "number":"2",
        "text":"Уютный дворик радует глаз. И нос. И ух. Вперед убегает дорожка, вдоль которой выставлены статуи. Кого тут только нет: жирафов нет, кроликов с ежиками нет, сурков нет, пингвинопитеков тоже нет. А есть гномы разнообразных форм, цветов и пропорций. Влево и вправо так же идут тропинки. Левая ведет к курятнику, правая к туалету. Куда вы направляетесь?",
        "options":[
           {
              "text":"Налево",
              "route":"3"
           },
           {
              "text":"Направо",
              "route":"4"
           },
           {
              "text":"Прямо",
              "route":"5"
           }
        ]
     },
     {
        "number":"3",
        "text":"Деревянный курятник манит ароматом свежеиспуганной курицы.",
        "options":[
           {
              "text":"Войти",
              "route":"6",
              "condition":{
                "body": "!black && !white",
                "args": ["white", "black"]
              }
           },
           {
              "text":"Войти",
              "route":"6a",
              "condition":{
                "body": "black && !white",
                "args": ["white", "black"]
              }
           },
           {
              "text":"Войти",
              "route":"6b",
              "condition":{
                "body": "!black && white",
                "args": ["white", "black"]
              }
           },
           {
              "text":"Войти",
              "route":"6c",
              "condition":{
                "body": "black && white",
                "args": ["white", "black"]
              }
           },
           {
              "text":"Вернуться на перекресток",
              "route":"7"
           }
        ]
     },
     {
        "number":"4",
        "text":"Старый, ужасный, воняющий кокосом и лавандой, построенный по неевклидовой геометрии туалет, сияющий потусторонним желтым цветом и выкрашенный в мрачный салатовый цвет, как бы приглашает войти….",
        "options":[
           {
              "text":"Войти",
              "route":"8"
           },
           {
              "text":"Вернуться на перекресток",
              "route":"7"
           }
        ]
     },
     {
        "number":"5",
        "text":"Вы скачете по дорожке как маленькая девочка, мимо улыбающихся и танцующих статуй гномов, в воздухе порхают бабочки и небольшие серые нетопыри.  В воздухе разлит аромат жасмина, солнечный свет заливает все вокруг. И внезапно, без объявления войны, перед вами встает выбор: налево и направо. И конечно же, можно проскакать в обратном направлении.",
        "options":[
           {
              "text":"Налево",
              "route":"9"
           },
           {
              "text":"Направо",
              "route":"10"
           },
           {
              "text":"Проскакать на первый перекресток",
              "route":"7"
           }
        ]
     },
     {
        "number":"6",
        "text":"В полумраке курятника, на вас смотри четыре глаза, либо это две нормальные курицы, либо четыре одноглазые, думайте вы…возможны еще варианты. Когда ваши глаза привыкают к полумраку, вы видите, что перед вами черная, и белая курицы.",
        "options":[
           {
              "text":"Поймать черную курицу",
              "route":"11"
           },
           {
              "text":"Поймать белую курицу",
              "route":"12"
           },
           {
              "text":"Осмотреться",
              "route":"13"
           },
           {
              "text":"Выйти",
              "route":"3"
           }
        ]
     },
     {
        "number":"6a",
        "text":"В ужасе и страхе, роняя  кукурузные хлопья, исполняя частушки «Сектор газа» на невероятном уровне громкости, по курятнику носится белая курица.",
        "options":[
           {
              "text":"Поймать ее",
              "route":"12"
           },
           {
              "text":"Уйти",
              "route":"3"
           }
        ]
     },
     {
        "number":"6b",
        "text":"Белая курица у вас в кармане. Но есть еще и черная…ваши ставки, господа.",
        "options":[
           {
              "text":"Поймать черную курицу",
              "route":"11"
           },
           {
              "text":"Выйти из курятника",
              "route":"3"
           }
        ]
     },
     {
        "number":"6c",
        "text":"Курятник пуст и темен, и только где-то на периферии зрения мелькает силуэт черной курицы, да на грани восприятия слышаться слова «Momento klizmo».",
        "options":[
           {
              "text":"Осмотреться",
              "route":"13"
           },
           {
              "text":"Выйти",
              "route":"3"
           }
        ]
     },
     {
        "number":"7",
        "text":"Старый знакомый перекресток снова приветствует вас. У него есть для вас минутка тишины и варианты сложного, судьбоносного выбора.",
        "options":[
           {
              "text":"К курятнику",
              "route":"3"
           },
           {
              "text":"К туалету",
              "route":"4"
           },
           {
              "text":"Прямо, вглубь двора",
              "route":"5"
           },
           {
              "text":"Выйти со двора",
              "route":"14"
           }
        ]
     },
     {
        "number":"8",
        "text":"И так, вы внутри. Обычный туалет типа «сортир»….не то, что снаружи…только вот он весь покрыт позолотой, а на стенах во множестве нарисованы маленькие розовые сфинксы. ",
        "options":[
           {
              "text":"Выйти",
              "route":"4"
           },
           {
              "text":"Хорошенько осмотреться",
              "condition":{
                "body": "!rake",
                "args": ["rake"]
              },
              "route":"15"
           },
           {
              "text":"Хорошенько осмотреться",
              "condition":{
                "body": "rake",
                "args": ["rake"]
              },
              "route":"15a"
           }
        ]
     },
     {
        "number":"9",
        "text":"Огромный древний дуб раскинул свои ветви, словно в попытке захватить мир, он крепок и могуч, его лист зелен, а ствол покрыт странными символами",
        "options":[
           {
              "text":"Вернуться обратно",
              "route":"16"
           },
           {
              "text":"Осмотреть дуб",
              "route":"17",
              "condition":{
                "body": "!carpet",
                "args": ["carpet"]
              }
           },
           {
              "text":"Осмотреть дуб",
              "route":"17a",
              "condition":{
                "body": "carpet",
                "args": ["carpet"]
              }
           }
        ]
     },
     {
        "number":"10",
        "text":"Пройдя по дороге вы видите будку, нет, не так. ЦАРЬ БУДКУ. Монументальное строение, способное поспорить своими размерами с некоторыми мавзолеями древних королей. Но это то, что вы ищете, убежище от грозы. Что то вам подсказывает, что входить туда в пустыми руками никак нельзя.",
        "options":[
           {
              "text":"Зайти в будку",
              "route":"18"
           },
           {
              "text":"Вернутся к развилке",
              "route":"16"
           },
           {
              "text":"Убежать со двора",
              "route":"14"
           }
        ]
     },
     {
        "number":"11",
        "text":"Протянув руку к черной курице вы в нерешительности замерли. И страх заглянул в вашу душу, и сжал ваше сердце и переместил его вам в пятки. И было от чего. Глаза курицы запылали потусторонним синим огнем, она истошно заорала, сделала сальто назад, села на шпагат и растаяла во мраке. Вам остается ловить белую курицу или убегать.",
        "options":[
           {
              "text":"Ловить белую курицу",
              "route":"12"
           },
           {
              "text":"Выйти из курятника",
              "route":"3"
           }
        ]
     },
     {
        "number":"12",
        "text":"Хлопая ушами вы мчитесь за курице. Курица мчится от вас. Взрывы, осколки снарядов, стоны умирающих…все это было где-то не здесь. А курица, выделил новую порцию адреналина, внезапно развернулась и прыгнула вам в руки. Вы довольно кладете курицу в карман.",
        "options":[
           {
              "text":"Осмотреться",
              "route":"13"
           },
           {
              "text":"Уйти",
              "route":"3"
           }
        ]
     },
     {
        "number":"13",
        "text":"Под потолком висит лампа, но она не работает, В окне виднеется солнце, но оно не светит, так как это не окно, а картина. Под ногами душистая солома, но в ней нет денег, золота и акций General Motors. Послушав аромат испуганных куриц вы выходите.",
        "options":[
           {
              "text":"Выйти",
              "route":"3"
           }
        ]
     },
     {
        "number":"14",
        "text":"Выбежав с этого чудного и чудесного дворика, вы успеваете заметить, как он тает за вашей спиной. На вас обрушивается ливень. Сверкают молнии, раскаты грома подобны удару молота по наковальне и в этих раскатах вы слышите хохот мстительных богов. Порывы ветра пронизывают насквозь. За мгновение вы становитесь совершенно мокрым. Вы унижены, обмочены, морально смяты, и, как будто этого недостаточно, в вас бьет молния. Конец."
     },
     {
        "number":"15",
        "text":"Вы оглядывайте этот невероятный интерьер. Всё вокруг блестит и ласкает взгляд. Слышится какая-то причудливая мелодия. Звонко раздается капель канализации. В углу веселые и энергичные скарабеи катают свои сокровища. Ваш взгляд привлекает отверстие в полу. Как тщетность бытия, оно смотрит на вас. А вы на него. Вас, как будто затягивает внутрь…А, нет, это воображение разыгралось.  Вы видите, как в темноте отверстия что-то блестит.",
        "options":[
           {
              "text":"Взять непонятный предмет",
              "route":"19"
           },
           {
              "text":"Уйти",
              "route":"4"
           }
        ]
     },
     {
        "number":"15a",
        "text":"Вы оглядывайте этот невероятный интерьер. Всё вокруг блестит и ласкает взгляд. Слышится какая-то причудливая мелодия. Звонко раздается капель канализации.",
        "options":[
           {
              "text":"Уйти",
              "route":"4"
           }
        ]
     },
     {
        "number":"16",
        "text":"У вас два пути. Точнее два нормальных пути и скачки вдоль гномов.",
        "options":[
           {
              "text":"Налево",
              "route":"9"
           },
           {
              "text":"Направо",
              "route":"10"
           },
           {
              "text":"Вернуться на первый перекресток",
              "route":"7"
           }
        ]
     },
     {
        "number":"17",
        "text":"Вы осматривайте ствол дуба медленно и тщательно. Вся его поверхность покрыта замысловатым рельефом. Вот витязь, с курицей в руках заглядывает в жерло вулкана. Вот он же, но с странным копьем повергает на землю шерстяного дракона. Чуть дальше сюжет повествует о том, как жуки несут поверженного героя, и черная курица смеется над ним. Через 2 часа вы закончили осмотр. Вы счастливы и удовлетворены. Но ничего интересного не нашли. Сверху упали капли дождя,  вы посмотрели наверх. На нижней ветке висел персидский ковер. Его вполне можно достать чем-то длинным.",
        "options":[
           {
              "text":"Если у вас есть серебряные грабли",
              "route":"20"
           },
           {
              "text":"Если нет",
              "route":"16"
           }
        ]
     },
     {
        "number":"17a",
        "text":"Вы осматривайте ствол дуба медленно и тщательно. Вся его поверхность покрыта замысловатым рельефом. Вот витязь, с курицей в руках заглядывает в жерло вулкана. Вот он же, но с странным копьем повергает на землю шерстяного дракона. Чуть дальше сюжет повествует о том, как жуки несут поверженного героя, и черная курица смеется над ним.",
        "options":[
           {
              "text":"Уйти",
              "route":"16"
           }
        ]
     },
     {
        "number":"18",
        "text":"Осторожно, на цыпочках вы заходите в это строение. Пахнет псиной и несвежим изюмом. Метрах в 20 впереди, на голом мраморе лежит Хозяин будки. Это огромный волкодав, способный бросить вызов кому угодно, хоть драконам, хоть великанам. И он рычит, недовольно глядя на вас.",
        "options":[
           {
              "text":"Убежать",
              "route":"16"
           },
           {
              "text":"Подойти к нему",
              "route":"21"
           }
        ]
     },
     {
        "number":"19",
        "text":"Вы стараетесь ухватить блестящий предмет",
        "options":[
           {
              "text":"Далее",
              "route":"19a",
              "condition":{
                "body": "rand",
                "args": ["rand"]
              }
           },
           {
              "text":"Далее",
              "route":"19b",
              "condition": {
                "body": "!rand",
                "args": ["rand"]
              }
           }
        ],
        "calc":{
           "rand":"Math.random() >= 0.5"
        }
     },
     {
        "number":"19a",
        "text":"Не удержавшись, вы соскальзываете вниз. И погружаетесь в зловонную субстанцию. Вы спаслись от дождя, но какой ценой…Сознание покидает вас. На ваше счастье, скарабеям не чуждо понятие доброты и милосердия. Они вытащили, отмыли вас и привели в порядок. Теперь вы должны им.",
        "options":[
           {
              "text":"Далее",
              "route":"4"
           }
        ]
     },
     {
        "number":"19b",
        "text":"После нескольких попыток, вы все-же зацепили этот предмет кончиками пальцев, и смогли его вытянуть наружу. Это великолепные, легендарные, серебряные грабли. Они пришли к вам, ваша любовь, ваша судьба…ваша прелесть.",
        "options":[
           {
              "text":"Использовав туалет по назначению, вы выходите из него",
              "route":"4"
           }
        ],
        "update":{
           "rake":true
        }
     },
     {
        "number":"20",
        "text":"Никакие проблемы не могут остановить вас, если у вас есть Легендарный садовый инвентарь. Вы легко поддеваете граблями ковер, и он падает к вашим ногам.  Убрав его за голенище сапога, вы думаете, что же делать дальше",
        "options":[
           {
              "text":"Отдохнуть",
              "route":"22"
           },
           {
              "text":"Уйти",
              "route":"16"
           }
        ],
        "update":{
           "carpet":true
        }
     },
     {
        "number":"21",
        "text":"Вы подходите к этому чудовищу из древних легенд. Из его оскаленной пасти капает слюна.  Его глаза налиты кровью, он уже готов бросится на вас, чтобы сделать своей любимой женой.",
        "options":[
           {
              "text":"Далее",
              "route":"23",
              "condition":{
                "body": "white && carpet",
                "args": ["white", "carpet"]
              }
           },
           {
              "text":"Далее",
              "route":"25",
              "condition":{
                "body": "rake && !white && !carpet",
                "args": ["white", "carpet", "rake"]
              }
           },
           {
              "text":"Далее",
              "route":"24",
              "condition":{
                "body": "!(white && carpet) && !(rake && !white && !carpet)",
                "args": ["white", "carpet", "rake"]
              }
           }
        ]
     },
     {
        "number":"22",
        "text":"Вы улеглись спать прямо под дубом. Странное решение, учитывая, что гроза все ближе, а вам ни в коем случае нельзя попадать под нее. Удар грома  вырвал вас из нежного сна и вы, вскочив в панике, бездумно бросились бежать.",
        "options":[
           {
              "text":"Далее",
              "route":"14"
           }
        ]
     },
     {
        "number":"23",
        "text":"Вы осторожно, без резких движений, вытаскиваете курицу из кармана и предлагаете гиганту. Он достает исполинскую соломинку и втягивает курицу через нее в пасть, и довольно облизывается. Осмелев, вы расстилаете для Него ковер, и он ложится на него. Это хороший знак. Вы ложитесь рядом, прислонившись как теплому и мягкому боку гигантского зверя. Вы справились с задачей, и нашли убежище. Снаружи разразилась гроза, но она не причинит вам вреда. Под мерное дыхание хозяина будки вы засыпаете. Конец."
     },
     {
        "number":"24",
        "text":"Рычание усиливается, и пес вскакивает на ноги. Вы не хотите испытывать судьбу и выбегаете прочь.",
        "options":[
           {
              "text":"Далее",
              "route":"14"
           }
        ]
     }
  ]
}